[Hotstrings]
:?xo:.l=zmd:winmove(l)	;窗口移动到最左侧-需要终止符触发
:?xo:.r=zmd:winmove(r)	;窗口移动到最右侧-需要终止符触发
:?xo:.t=zmd:winmove(t)	;窗口移动到最顶端-需要终止符触发
:?xo:.b=zmd:winmove(b)	;窗口移动到最底端-需要终止符触发
:?xo:.c=zmd:winmove(c)	;窗口移动到居中位置-需要终止符触发

[Cmds]
; plugin winctl
hide=%xfold%\tools\WinCtl.exe hide {%h} -hidden			;隐藏窗口
unhide=%xfold%\tools\WinCtl.exe unhide -hidden			;取消隐藏窗口
unhideall=%xfold%\tools\WinCtl.exe unhide all -hidden	;取消隐藏所有窗口

movel=send(#+{Left})	;切换窗口到左侧屏幕
mover=send(#+{Right})	;切换窗口到右侧屏幕

[Cmds-alias]
max=winmax				;窗口最大化
min=winmin				;窗口最小化
restore=winrestore		;窗口还原
top=winTopToggle		;窗口置顶

ml=movel				;切换窗口到左侧屏幕
mr=mover				;切换窗口到右侧屏幕
